#!/usr/bin/python
# -*- coding: UTF-8 -*-


print("--- Tech Teacher Blog ---")
print("--- データサイエンスとは何か？目指すために必要なスキルと勉強方法について。 ---")


"""
最近ではデータサイエンスに注目が集まっています。
個人や企業が蓄積して扱えるデータが増え、大規模なデータ活用が可能になりました。
膨大なデータのリアルタイム処理も可能になり、データ活用に注目が集まる今、
あらゆる分野でデータサイエンスの重要性が高まっています。


データサイエンスに興味がある方、はじめて学ぶ方に向けて、データサイエンスとは何か説明していきます。
データサイエンティストを目指している方はぜひご覧ください。
"""


print("--- １. そもそもデータサイエンスとはなに？ ---")


"""
（１）データサイエンスとは

 データサイエンティストを簡潔に表すと「膨大なデータを分析し、
 そこから得られた結果をビジネスに活用する」職業です。
統計学、機械学習、情報科学理論、プログラミングなどの理論を活用してデータを分析、
有益な知見を見いだすことを指します。
複数の研究分野の知識をもとに、企業の業務システムやインターネット、
アンケートなどで集約したさまざまなデータに潜む知見や価値を明らかにし、
社会課題や経営課題の解決に役立てます。
また、データサイエンスを実行する者を「データサイエンティスト」と呼んでいます。


（２）データサイエンティストの仕事内容

データサイエンティストは、膨大なデータの解析結果からビジネスで活用できる情報を引き出して、
重要な意思決定をサポートする仕事です。
大まかな仕事の流れは以下のとおりです。

    企業が抱えている課題を抽出
    課題解決に関連性のあるデータの収集・分析
    資料を作成し、共有する
    業務へ組み込んだ際の評価や改善

 このように、最終的にビジネスへつなげるのがデータサイエンティストの役割です。
ほかにも、不適切な情報を処理し、データ収集環境を整える業務もあります。


（３）データサイエンティストの需要

現在日本だけでなく世界全体の流れとして、
データを駆使してあらゆることを自動化していく流れになっています。
ビッグデータを扱える人は日本でも少なく、非常に希少価値のある職種であり、
データサイエンティストの将来性は高いと言えます。
企業が求めるスキルを満たす人材が不足していることから、
データサイテンティストの育成はいまや国家レベルの課題となっています。
一方で、将来ＡＩに取って代わられる可能性について論じられる向きもあります。
計算処理に関する速度や、精度が高い識別や予測を要する領域に関する部分は、
今後ＡＩに代替されていくと考えられているからです。
しかし、根本的にデータを使って方針をどう変えていくか、
どこに価値を見いだすかは企業とサイエンティストが話し合い、実行していくことになります。
現場と一体になって、データから改善を提案できて成果をあげるサイエンティストは、
その需要がなくなることはなく今後も増大し続けていくでしょう。
"""


print("--- ２. データサイエンスの向き不向きについて ---")


"""
（１）データサイエンティストに向いている人

 膨大な量の情報から、様々なことを読み解くのがデータサイエンティストの仕事です。
この仕事は、ＩＴ関係の中でも特に情報の活用を専門としている分、
特殊な能力を要求されるのが特徴と言えます。
データ処理や分析といった地道な作業も多いため、忍耐力や根気強さも大切です。
ビッグデータを効率的に処理する必要があり、情報活用の中核的な役割を担うため責任も重大です。
そんなデータサイエンティストには、どのような人が向いているのか、以下でチェックしていきましょう。


情報収集や分析が得意

目的に照らし合わせて最適な情報を集め、物事を構成する要素や側面について
分析するのが得意な人は、データサイエンティストに向いています。
様々な物差しから比較や検証をおこない、仮説の立案と事実の探求を繰り返すことで、
目標達成や課題の克服、効果の検証など、与えられたミッションをこなすのが役割だからです。
データ分析が事業の拡大に貢献し、新しい施策を立案してビジネスを作り出すこともありますが、
基本的には意思決定をサポートする仕事です。
情報処理の作業では、長期間にわたっての地道な取り組みが欠かせません。
コツコツとデータの整理に取り組むのが楽しいと思える方とは、相性が良い仕事です。
また、プログラミングや数学、統計学の深い知識を持っていれば、
ビジネスとして活用できる価値あるデータを引き出せます。


論理的に思考できる

ビジネス上の課題を論理的思考で導くことが大切です。
ミッションを達成するために、どのようなデータを用いるか、集めた情報をいかに役立てるかなど、
常に倫理的に考えることが重要です。
データの処理は一定の規則性をもって行われるので、解析や分析をおこなう際に、
論理的ではない心情や感情的な思考が混在するのは望ましくありません。
データ分析の過程においても直感や閃きを否定するわけではありませんが、
憶測や主観などの曖昧な要素を根拠としてしまうと、全体の整合性が崩れてしまいます。
あくまでもデータを論理的に突き詰めることで、仮説を裏付け、
真実を発見するのがデータサイエンティストの役割です。
俯瞰的な視点から冷静な思考で仕事をこなせる方に、向いている仕事です。


探究心が強い

課題解決に向けてさまざまな仮説を立てて検証し、
データの分析や評価するのがデータサイエンティストです。
「膨大なデータの中でも必要な情報はどれだろう」「データを有効活用するにはどうしたらよいだろう」と、
常に考えながら仕事をしなくてはなりません。
データサイエンティストが、地道な取り組みを続けられる理由としては、
彼らの強い探求心が挙げられます。
何かを深く知りたいという強い好奇心があれば、この職業に大きなやりがいを感じるはずです。
そのため、探求心が強く試行錯誤して改善に努めるのが好きな人に向いています。 



（２）データサイエンティストに向いていない人

 知的で社会的地位も高く、注目度が高いのがデータサイエンティストの魅力と言えます。
しかし、実際には世間一般のイメージとは異なる側面もあります。
表面的な魅力に憧れをもって、この世界に飛び込むと、思っても見なかったギャップに驚くかもしれません。
そこで、データサイエンティストに向いていないと考えられる人についても、確認していきましょう。


華々しいイメージのみに憧れる人

高度な知的能力を武器に、世界の常識を覆し続けるデータサイエンティストは、
注目の的になってきました。
この華やかなイメージに憧れる方も散見されますが、注意したいのは、その業務の実態です。
基本的にＩＴ技術を使ってデータを収集・解析するのですが、その業務は地道なものと言えます。
付随する業務も、定期的なレポートの作成や会議への参加も含め、
人によっては面倒に感じるものが少なくありません。
堅実さが求められる地道な取り組みが多いため、華やかな見た目だけに憧れを感じている場合は、
ミスマッチが起こる可能性が高いです。


計算や細かな作業が苦手

大量の数値を扱い統計モデルの作成や人工知能による分析作業をおこなうデータサイエンティストは、
データや数字とひたすら向き合わなければならないため、数字が苦手な人には厳しい仕事です。
実際のデータにも目を通しながら、特徴のある箇所やパターンを確認して、
利用するアルゴリズムや分析手法を考えます。
そのため、計算が不得意だと、何かと苦戦する可能性があります。
また、データ処理では気の遠くなるような細かな入力作業なども多いため、
大雑把な性格で地味な作業が嫌いな方も、この職業ではストレスが溜まりそうです。


数学やデータが嫌い

データサイエンティストの実務は、統計や数学的な理論をもちいたデータの活用です。
コンピュータを利用した計算では、数学的知識を根拠にロジックを考え分析します。
さらに、分析したデータは資料にまとめ、データサイエンスに詳しくない人にも分かるよう可視化します。
このような地道な作業の連続であるため、根気強さや忍耐力も大切です。
したがって、数学に苦手意識がある方や、大量のデータを見ると嫌悪感を覚える方も、
この仕事との相性が良いとは言えません。
"""


print("--- ３. データサイエンティストに必要な3つのスキル ---")


"""
データサイエンティストには、次の3つのスキルが不可欠です。
 （１）ＩＴの知識

データの収集、格納、処理、加工などでは、次のＩＴスキルが求められます。

    ＰｙｔｈｏｎやＲ言語などを用いてアルゴリズムの開発・実装をするプログラミングのスキル
    データベース操作に必要なＳＱＬの知識
    ＨａｄｏｏｐやＳｐａｒｋなどのビッグデータの分散処理に関するスキル

 この他にも経営課題の背景を理解するためにも、ビッグデータを収集するＩｏＴやＷｅｂサイト、
 セキュリティなどの知識もあるとよいです。


（２）統計学

収集したデータを適切に解析するために、以下の統計学などの知識も要求されます。 

    確率統計、ベイズ統計、線形代数、ラプラス変換などの数学の知識
    統計学やパターン認識、ＡＩなどのデータ分析のスキル
    ＳＡＳやＳＰＳＳなどのデータ分析ツールの知識


（３）ビジネススキル

ビジネススキルは、顧客が抱えるビジネス課題を整理し、解決に導くためのスキルといえます。

分析したデータの活用方法の提案もデータサイエンティストの重要な仕事であるため、
次のようなビジネススキルも求められます。

    改善対象となる業務全般に関する知識
    課題を解決に導くための論理的思考
    ドキュメンテーション・プレゼンテーション能力 
"""


print("--- ４. Ｐｙｔｈｏｎ・Ｒ言語の勉強方法 ---")


"""
（１）Ｐｙｔｈｏｎの勉強方法

Ｐｙｔｈｏｎは色々なサービスが展開していて学べるところはたくさんありますが、
自分で進められる自信のある人はＵｄｅｍｙの教材を視聴してみることをオススメします。
Ｕｄｅｍｙは世界最大のオンライン学習プラットフォームで
非常に分かりやすく色んなコースがあるので自分のやりたいことが
明確にきまっている人にオススメのプラットフォームになります。


（２）Ｒ言語の勉強方法

 Ｒ言語を勉強したい方は、動画でＲ言語の書き方が学べる「ドットインストール」がオススメです。
実際に独学でプログラミングを始めた人の中には、ドットインストールから学習を始めた方も多いです。
「実際のコードの書き方から学びたい！」方や、「費用を安く抑えたい」方は、
一度ドットインストールを試してみてはいかがでしょうか。
"""


print("--- ５. まとめ ---")


"""
ここまでデータサイエンスとはどんな仕事か、必要なスキルやその勉強方法について紹介してきました。
データサイエンティストは様々な分野で活躍できます。
皆さんも自分のやりたい分野をじっくり考えてみるとどこかに必ず活かせる「データ」があるはずです。
ぜひこの記事を参考に、データサイエンティストを目指してみてください。
"""
