#!/usr/bin/python
# -*- coding: UTF-8 -*-


print("--- Python学習講座 ---")
print("--- Python応用編 ---")
print("--- NumPy入門 基本的な線形代数計算 ---")


print("--- numpy.linalg ---")


"""
numpy.linalgで基本的な線形代数演算が提供されています。
線形代数の教養課程レベルの教科書によくある以下のトピックをピックアップしました。

実際に手を動かして行列計算すると、だんだん慣れてくると思います。
初学者の方はまずはコピペで動かしてみてください。

基本的な線形代数計算 その1 ノルム・正規化・正規直交化
基本的な線形代数計算 その2 転置・トレース・逆行列・行列式
基本的な線形代数計算 その3 連立方程式
基本的な線形代数計算 その4 固有値

実際に業務などで計算する場合はScipyを使用することが多いのですが、
以前書いたとおりNumPyが基礎となるため、
簡単な計算でNumpyの配列の取り扱いに慣れると
今後の学習がスムーズになるかと思います。
"""




















































































