#!/usr/bin/python
# -*- coding: UTF-8 -*-


print("--- Python学習講座 ---")
print("--- Python応用編 ---")
print("--- TkinterでGUI ---")


"""
標準ライブラリのtkinterモジュールを使用すると
PythonでGUIのアプリケーションを比較的簡単に作成することができます。
この講座ではこのtkinterモジュールの使用方法について解説していきます。
（GUIとは、グラフィカルユーザインターフェース
(Graphical User Interface)の略語で、
表計算ソフトやブラウザ、メーラ普段私達がPCなどで使用する
「画面が出る普通のソフト」を指します。）
"""


print("--- Tkinterとは ---")


"""
TkinterとはPythonでGUIのアプリケーションを作成するためのライブラリで、
日本語では「てぃーけーいんたー」や「てぃーきんたー」と発音されることが多いようです。
GUIアプリケーションを一から作成するとなるとかなり難しいため、
通常GUIツールキットと呼ばれる部品の集まり使用します。
TkinterはTk（てぃーけー）というGUIツールキットを
Pythonで使用することができるようにしたものです。
Tkinterは標準ライブラリのtkinterモジュールで使用できます。
"""


print("--- もくじ ---")


"""
Tkinterは機能が多岐にわたるため、
最終的に読者が概略を理解することができ、
電卓レベルの簡単なデスクトップアプリケーションを
作成することができるレベルとなることを目標とします。
"""
