#!/usr/bin/python
# -*- coding: UTF-8 -*-


print("--- Python学習講座 ---")
print("--- Python応用編 ---")
print("--- pandas入門 pandasとは ---")


print("--- pandasとは？ ---")


"""
pandasとはpythonのデータ分析ライブラリの1つで、
大きな表データ、行列を扱うことができます。
特に、時系列データを分析する際には最適といえます。
ピボットテーブル、groupby、ソートなどの集計処理や、
matplotlibと連携した可視化などが可能であるため、
表計算ソフトの機能の大半は置き換えることができます。
このため、分析以外にもExcelを使用した業務の自動化にも
役立てることができるでしょう。
"""


print("--- pandasのデメリット ---")


"""
pandasを使用すると色んな分析が簡単にできるようになります。
特に複雑な統計処理が数行でかけてしまう点は大きな魅力でしょう。
分析に最適なライブラリですが、日々の運用で使用するべきかどうかは検討が必要です。
（Python全般に言えることなのですが、）
スクリプト言語故に簡単に書ける反面、遅い点がデメリットです。
運用でスピードが求められる場合、並列分散処理したり、
以下で部分的に置き換えられないかどうかの検討もしてください。

    RDB：Joinは圧倒的に速いです。
    高速なコンパイラ型言語(Java、C++など)
    統計ソフト：SPSS、Rなど。
    Excel：意外と侮れません。
"""
